#include <stdio.h>

int main()
{
  int x, y, sum, comp, res, div, mod;						/* Объявление переменных */

  printf ("Введите два целых числа:\n");					/* Подсказка */
  scanf ("%d%d", &x, &y);							/* Вводим два числа */
  sum = x + y; 									/* Вычисляем сумму */
  comp = x * y; 								/* Вычисляем произведение */
  res = x - y; 									/* Вычисляем разность */
  div = x / y; 									/* Вычисляем деление */
  mod = x % y;									/* Вычисляем взятие по модулю */		
  printf ("Сумма двух чисел: %d\n", sum);
  printf ("Произведение двух чисел: %d\n", comp);
  printf ("Разность двух чисел: %d\n", res);
  printf ("Частное двух чисел: %d\n", div);
  printf ("Результат взятия по модулю двух чисел: %d\n", mod);
  
}
