/* Изобразить модель шахматной доски используя 8 операторов printf   и второй вариант используя минимально количество  */


#include <stdio.h>

int main()
{
   printf("* * * * * * * *\n");
   printf(" * * * * * * * *\n");
   printf("* * * * * * * *\n");
   printf(" * * * * * * * *\n");
   printf("* * * * * * * *\n");
   printf(" * * * * * * * *\n");
   printf("* * * * * * * *\n");
   printf(" * * * * * * * *\n");
}

 /*Второй вариант*/

#include <stdio.h>

int main()
{
   printf("* * * * * * * *\n * * * * * * * *\n* * * * * * * *\n * * * * * * * *\n* * * * * * * *\n * * * * * * * *\n* * * * * * * *\n * * * * * * * *\n");
}
