/* Напишите программу, печатающую прямоугольник, овал, стрелку, ромб */

#include <stdio.h>

int main()
{
   printf("*********            ***              *               *\n");
   printf("*       *          *     *           ***             * *\n");
   printf("*       *         *       *         *****           *   *\n");
   printf("*       *         *       *           *            *     *\n");
   printf("*       *         *       *           *           *       *\n");
   printf("*       *         *       *           *            *     *\n");
   printf("*       *         *       *           *             *   *\n");
   printf("*       *          *     *            *              * *\n");
   printf("*********            ***              *               *\n");
}
